src/config/Documents/ЗаявкаНаВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозвратПоставщику</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетФотографий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаявкиНаБракПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетФотографийДляУтилизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииЗаявкаНаВозвратПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительскоеУдостоверение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияВыдавшаяДоверенность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицоДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркаАвто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРасположения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДавлениеВШине</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерДиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСнятияСЭксплуатации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерШтампаОТК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомпенсации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипКомпенсацииПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСФ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаБрак</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаБрак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НарушениеПравилХранения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма с НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Enums/СостоянияЗаявкиНаБрак.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаявкиНаБрак</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнатьБрак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ЗаявкаНаВозвратПоставщику/Ext/ObjectModule.bsl
Функция ПечатьАШК() Экспорт
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("ЗаявлениеАШК");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьТовар = Макет.ПолучитьОбласть("Детали");
    ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал = Макет.ПолучитьОбласть("ПдвКуртов");

	СведенияОКонтрагенте = СведенияОЮрФизЛице(Контрагент, Дата);
	ОбластьШапка.Параметры.Контрагент       = СведенияОКонтрагенте.ПолноеНаименование;
	ОбластьШапка.Параметры.ЮридическийАдрес = СведенияОКонтрагенте.ЮридическийАдрес;
	ОбластьШапка.Параметры.Телефоны         = СведенияОКонтрагенте.Телефоны;
	ОбластьШапка.Параметры.Организация = Организация.Наименование;
	ОбластьШапка.Параметры.РеквизитыОрганизации =  ОписаниеОрганизации(СведенияОЮрФизЛице(Организация, Дата), "ЮридическийАдрес, Телефоны");
	ТабДок.Вывести(ОбластьШапка);
	н =1 ;
	Для Каждого СтрТовар из Товары Цикл
		ОбластьТовар.Параметры.Заполнить(СтрТовар);
		ОбластьТовар.Параметры.НомерПП = н;
		ОбластьТовар.Параметры.ДатаИзготовленияИСерийныйНомер = ""  + ?(ЗначениеЗаполнено(СтрТовар.ДатаПроизводства),СтрТовар.ДатаПроизводства,"") + 
		?(ЗначениеЗаполнено(СтрТовар.СерийныйНомер)," №:" + СтрТовар.СерийныйНомер,"");
		ОбластьТовар.Параметры.СчетФактура = ?(ЗначениеЗаполнено(СтрТовар.НомерСФ),"№: " + СтрТовар.НомерСФ,"") + ?(ЗначениеЗаполнено(СтрТовар.ДатаСФ)," от "+ Формат(СтрТовар.ДатаСФ,"ДФ=dd.MM.yyyy"), "");
		ТабДок.Вывести(ОбластьТовар);
		н = н + 1;
	КонецЦикла;	
	ОбластьИтоги.Параметры.КоличествоИтого = Товары.Итог("Количество");
	ТабДок.Вывести(ОбластьИтоги);
	ОбластьПодвал.Параметры.Организация = Организация.Наименование;
	ОбластьПодвал.Параметры.Контрагент  = СведенияОКонтрагенте.ПолноеНаименование;
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	//ТабДок.Показать();
	Возврат ТабДок;
КонецФункции

Функция ПечатьАктаУтилизации() Экспорт
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("АктУтилизации");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьТовар = Макет.ПолучитьОбласть("Детали");
    ОбластьДопИнфо = Макет.ПолучитьОбласть("ДопИнфо");
	ОбластьНарушениеХранения = Макет.ПолучитьОбласть("НарушениеХранения");
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал = Макет.ПолучитьОбласть("ПдвКуртов");

	ТабДок.Вывести(ОбластьШапка);
	ТЗНоменклатура = ТОвары.Выгрузить();
	ТЗНоменклатура.Свернуть("Номенклатура","Количество");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаявкаНаВозвратПоставщикуТовары.Количество) КАК Количество,
	|	ЗаявкаНаВозвратПоставщикуТовары.ЗаявкаНаБрак,
	|	ЗаявкаНаВозвратПоставщикуТовары.СерийныйНомер,
	|	ЗаявкаНаВозвратПоставщикуТовары.ДатаПроизводства
	|ИЗ
	|	Документ.ЗаявкаНаВозвратПоставщику.Товары КАК ЗаявкаНаВозвратПоставщикуТовары
	|ГДЕ
	|	ЗаявкаНаВозвратПоставщикуТовары.ЗаявкаНаБрак.СостояниеЗаявки = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявкиНаБрак.ПризнатьБрак)
	|	И ЗаявкаНаВозвратПоставщикуТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура,
	|	ЗаявкаНаВозвратПоставщикуТовары.ЗаявкаНаБрак,
	|	ЗаявкаНаВозвратПоставщикуТовары.СерийныйНомер,
	|	ЗаявкаНаВозвратПоставщикуТовары.ДатаПроизводства
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка.Следующий() Цикл
		СтрокаНоменклатуры = Выборка.Номенклатура.Наименование + " - " + Выборка.Количество + " шт. сер. № ";
		ВыборкаДетали= Выборка.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			Если ВыборкаДетали.ДатаПроизводства = "нет" Тогда
				ДатаПроизводстваСтр = "";
			Иначе
				ДатаПроизводстваСтр = ВыборкаДетали.ДатаПроизводства;
			КонецЕсли;
			СтрокаНоменклатуры = СтрокаНоменклатуры + ДатаПроизводстваСтр + " " + ВыборкаДетали.СерийныйНомер + ";"
		КонецЦикла;
		ОбластьТовар.Параметры.СтрокаНоменклатуры =  СтрокаНоменклатуры;
		ТабДок.Вывести(ОбластьТовар);
	КонецЦикла;
	
	
	ТЗНеправильноеХранение = Товары.Выгрузить(Новый Структура("НарушениеПравилХранения",Истина));
	ТЗНеправильноеХранение.Свернуть("Номенклатура","Количество");
	Если ТЗНеправильноеХранение.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьДопИнфо);
	КонецЕсли;
	
	Для Каждого СтрТовар из  ТЗНеправильноеХранение Цикл
		СтрокаНепрХранение = СтрТовар.Номенклатура.Наименование  + " - " + СтрТовар.Количество + " шт.";
		ОбластьНарушениеХранения.Параметры.СтрокаНоменклатураХранение = СтрокаНепрХранение;
		ТабДок.Вывести(ОбластьНарушениеХранения);
	КонецЦикла;	
	ОбластьПодвал.Параметры.ТекДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");	
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции

Функция ПечатьСлужебнойЗаписки()  Экспорт
	ТабДок=Новый ТабличныйДокумент;
	Макет=ПолучитьМакет("СлужебнаяЗаписка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьТовар = Макет.ПолучитьОбласть("Детали");
	Попытка
		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклоненияФИО", "Decl", ТипВнешнейКомпоненты.Native); 
		Объект = Новый("AddIn.Decl.CNameDecl");
	Исключение
		Сообщить("Не удалось подключить внешнюю компоненту по причине: " + ОписаниеОшибки()); 
	КонецПопытки;
	
	Падеж = 2; //Родительный: от кого? чего? 
	
	РезультатФИО = "";
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Сообщить("Не заполнено основное контактное лицо контрагента!", СтатусСообщения.Важное);
	Иначе
		СтрокаФИО = Ответственный.Наименование; 
		РезультатФИО = Объект.Просклонять(СтрокаФИО, Падеж);
	КонецЕсли;		
 	ОбластьШапка.Параметры.ОтветственныйРП = РезультатФИО;
	ОбластьШапка.Параметры.Контрагент = Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.Номер = Номер;

	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаВозвратПоставщикуТовары.Склад,
	|	СУММА(ЗаявкаНаВозвратПоставщикуТовары.Количество) КАК Количество,
	|	ЗаявкаНаВозвратПоставщикуТовары.Поставка,
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура.Код КАК Код,
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаявкаНаВозвратПоставщикуТовары.Цена КАК Цена,
	|	СУММА(ЗаявкаНаВозвратПоставщикуТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ЗаявкаНаВозвратПоставщику.Товары КАК ЗаявкаНаВозвратПоставщикуТовары
	|ГДЕ
	|	ЗаявкаНаВозвратПоставщикуТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура,
	|	ЗаявкаНаВозвратПоставщикуТовары.Склад,
	|	ЗаявкаНаВозвратПоставщикуТовары.Поставка,
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура.Код,
	|	ЗаявкаНаВозвратПоставщикуТовары.Номенклатура.Артикул,
	|	ЗаявкаНаВозвратПоставщикуТовары.Цена
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	МАКСИМУМ(Цена)
	|ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока Выборка.Следующий() Цикл
		ОбластьТовар.Параметры.Заполнить(Выборка);
		ВыборкаДетали= Выборка.Выбрать();
		Поставка = "";
		ПоставкаПред = "";
		Склад = "";
		СкладПред = "";
		Пока ВыборкаДетали.Следующий() Цикл  
			Если ВыборкаДетали.Поставка <> Документы.ПоступлениеТоваровУслуг.ПустаяСсылка() и  ПоставкаПред <> ВыборкаДетали.Поставка Тогда
				Поставка = Поставка + ВыборкаДетали.Поставка.Номер  + " от " + Формат(ВыборкаДетали.Поставка.Дата, "ДФ=dd.MM.yyyy")+
				?(ВыборкаДетали.Количество() >1," - " + ВыборкаДетали.Количество + " шт;", ";") +  Символы.ПС;
			КонецЕсли;
			ПоставкаПред = ВыборкаДетали.Поставка;
			Если ВыборкаДетали.Склад <> Справочники.Склады.ПустаяСсылка() и  СкладПред <> ВыборкаДетали.Склад Тогда
				Склад = Склад + ";" + ВыборкаДетали.Склад + Символы.ПС;
			КонецЕсли;
			СкладПред = ВыборкаДетали.Поставка;
		КонецЦикла;
		
		ОбластьТовар.Параметры.Поставка =  Поставка;
		ОбластьТовар.Параметры.Склад =  Склад;

		ТабДок.Вывести(ОбластьТовар);
	КонецЦикла;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции
